{
  "buffs_health_points": "Increases the champion's maximum health points.",
  "buffs_health_regen": "Enhances the champion's health regeneration per second.",
  "buffs_resource": "Increases the champion's maximum resource pool (Mana, Energy, etc.).",
  "buffs_resource_regen": "Improves the rate at which the champion regenerates their resource.",
  "buffs_attack_speed": "Boosts the champion's attack speed, allowing them to attack more frequently.",
  "buffs_armor_penetration": "Increases the champion's ability to bypass a portion of the target's armor.",
  "buffs_magic_penetration": "Increases the champion's ability to bypass a portion of the target's magic resistance.",
  "buffs_vamp": "Grants the champion healing based on a percentage of damage dealt (lifesteal or spell vamp).",
  "buffs_magic_resists": "Increases the champion's magic resistance, reducing incoming magic damage.",
  "buffs_armor": "Increases the champion's armor, reducing incoming physical damage.",
  "buffs_attack_damage": "Increases the champion's base attack damage (AD).",
  "buffs_ability_power": "Enhances the champion's ability power (AP), increasing magic damage output.",
  "buffs_movement_speed": "Boosts the champion's movement speed, allowing for faster mobility.",
  "buffs_cooldown": "Reduces or completely resets the cooldown of some ability/abilities, or increases the champion's ability haste",
  "buffs_crit_damage": "Increases the damage multiplier on critical strikes.",
  "buffs_crit_rate": "Increases the chance of landing a critical strike on attacks.",
  "buffs_tenacity": "Reduces the duration of crowd control effects on the champion.",
  "buffs_heal/shield_power": "Enhances the effectiveness of healing or shielding abilities.",
  "buffs_gold": "Provides some additional source of gold income.",
  "buffs_attack_range": "Extends the champion's attack range, allowing attacks from a greater distance.",
  "buffs_exp": "Increases the amount of experience gained, allowing for faster leveling.",
  "buffs_damage_amplifier": "Boosts the overall damage output dealt to enemies."
}
